In [38]:
import pandas as pd
import numpy as np
from sklearn import datasets 
import nltk, re, pprint

In [16]:
articles_data = pd.read_csv('articles.csv')
bills_data = pd.read_csv('bills.csv')
hierarchy_data = pd.read_csv('hierarchy.csv')

In [61]:
#checking values
articles_data.head()

    id                                         name
0   89                           rin bar 150g rs.10
1  149  parle hide&seek chocolate chip cookies 120g
2  308                                  sabena 450g
3  375          britannia marie gold biscuits rs.22
4  404  britannia 50-50 maska chaska biscuits rs.10

In [18]:
bills_data.head()

   article_id   sale_date  unit_price  quantity  bill_no  total_price
0          89  2018-07-06      8.3000         1   526472       8.3000
1          89  2018-07-06      8.3040         5   526593      41.5200
2          89  2018-07-07      8.3057         7   526689      58.1399
3          89  2018-07-07      8.3000         1   526696       8.3000
4          89  2018-07-07      8.3067         6   526696      49.8402

In [73]:
hierarchy_data.head()

   article_id     category_name               subcategory_name brand_name
0          89        detergents                   washing bars        rin
1         149          biscuits                        cookies      parle
2         308  utensil cleaners               dishwash powders     sabena
3         375          biscuits  glucose marie & milk biscuits  britannia
4         404          biscuits                 salty biscuits  britannia

In [37]:
#checking null values. 
articles_data.isna().values.any()
bills_data.isna().values.any()
hierarchy_data.isna().values.any()
# result shows that no column in all the 3 dataset has null values

False

In [39]:
nltk.download()
# this will open a window "NLTK downloader" from where you can choose the corpora and models to download

showing info https://raw.githubusercontent.com/nltk/nltk_data/gh-pages/index.xml

True

In [63]:
new = articles_data.name.str.split(" ", n = 1, expand = True) 
articles_data["brand"] = new[0]
articles_data['description'] = new[1]
articles_data.head()

,id,name,brand,description
0,89,rin bar 150g rs.10,rin,bar 150g rs.10
1,149,parle hide&seek chocolate chip cookies 120g,parle,hide&seek chocolate chip cookies 120g
2,308,sabena 450g,sabena,450g
3,375,britannia marie gold biscuits rs.22,britannia,marie gold biscuits rs.22
4,404,britannia 50-50 maska chaska biscuits rs.10,britannia,50-50 maska chaska biscuits rs.10

In [71]:
articles_data = articles_data.drop('name',1)
articles_data.head()

    id      brand                            description
0   89        rin                         bar 150g rs.10
1  149      parle  hide&seek chocolate chip cookies 120g
2  308     sabena                                   450g
3  375  britannia              marie gold biscuits rs.22
4  404  britannia      50-50 maska chaska biscuits rs.10

In [84]:
merged_artciles_history =  articles_data[articles_data['brand'].isin(hierarchy_data['brand_name'].unique().tolist())]
merged_artciles_history.head()

    id      brand                            description
0   89        rin                         bar 150g rs.10
1  149      parle  hide&seek chocolate chip cookies 120g
2  308     sabena                                   450g
3  375  britannia              marie gold biscuits rs.22
4  404  britannia      50-50 maska chaska biscuits rs.10

In [88]:
# merged_artciles_history.count()
hierarchy_data.head()

   article_id     category_name               subcategory_name brand_name
0          89        detergents                   washing bars        rin
1         149          biscuits                        cookies      parle
2         308  utensil cleaners               dishwash powders     sabena
3         375          biscuits  glucose marie & milk biscuits  britannia
4         404          biscuits                 salty biscuits  britannia

In [95]:
# hierarchy_data = pd.merge(merged_artciles_history,hierarchy_data)
new_data = merged_artciles_history
new_data.rename(columns={'brand':'brand_name'},inplace=True)
new_data.head()

/home/madmonkey/miniconda3/lib/python3.6/site-packages/pandas/core/frame.py:3778: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  return super(DataFrame, self).rename(**kwargs)

    id brand_name                            description
0   89        rin                         bar 150g rs.10
1  149      parle  hide&seek chocolate chip cookies 120g
2  308     sabena                                   450g
3  375  britannia              marie gold biscuits rs.22
4  404  britannia      50-50 maska chaska biscuits rs.10

In [98]:
data_merged = pd.merge(new_data,hierarchy_data)
data_merged.head()

,id,brand_name,description,article_id,category_name,subcategory_name
0,89,rin,bar 150g rs.10,89,detergents,washing bars
1,149,parle,hide&seek chocolate chip cookies 120g,149,biscuits,cookies
2,308,sabena,450g,308,utensil cleaners,dishwash powders
3,375,britannia,marie gold biscuits rs.22,375,biscuits,glucose marie & milk biscuits
4,375,britannia,marie gold biscuits rs.22,404,biscuits,salty biscuits

In [101]:
data_merged2 = pd.merge(data_merged,bills_data)
data_merged2.head()

,id,brand_name,description,article_id,category_name,subcategory_name,sale_date,unit_price,quantity,bill_no,total_price
0,89,rin,bar 150g rs.10,89,detergents,washing bars,2018-07-06,8.3000,1,526472,8.3000
1,89,rin,bar 150g rs.10,89,detergents,washing bars,2018-07-06,8.3040,5,526593,41.5200
2,89,rin,bar 150g rs.10,89,detergents,washing bars,2018-07-07,8.3057,7,526689,58.1399
3,89,rin,bar 150g rs.10,89,detergents,washing bars,2018-07-07,8.3000,1,526696,8.3000
4,89,rin,bar 150g rs.10,89,detergents,washing bars,2018-07-07,8.3067,6,526696,49.8402